# tap
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
# useful tools & essential packages
brew "bat"
brew "exa"
brew "pandoc"
brew "macvim"
brew "htop"
brew "lf"
brew "pyenv"
cask "mactex"
cask "rectangle"
cask "alacritty"
# other important
brew "coreutils"
brew "libssh2"
brew "gnupg"
# misc
brew "jq"
brew "yadm"
brew "task"
brew "ctags"
brew "cloc"
brew "clang-format"
# fonts
brew "fonts-encodings"
cask "font-fantasque-sans-mono"
cask "font-inconsolata"
