# tap
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
# useful tools & essential packages
brew "bat"
brew "exa"
brew "pandoc"
brew "macvim"
cask "mactex"
brew "htop"
# other important
brew "coreutils"
brew "libssh2"
brew "gnupg"
# misc
brew "jq"
brew "yadm"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
# fonts
cask "font-fantasque-sans-mono"
cask "font-inconsolata"
brew "fonts-encodings"
