# tap
tap "homebrew/bundle"
tap "homebrew/services"

# essentials
brew "htop"
brew "coreutils"
brew "libssh2"
brew "gnupg"
brew "llvm"
brew "libomp"
brew "gcc"

# tools
brew "bat"
brew "eza"
brew "pandoc"
brew "macvim"
brew "yadm"
brew "pyenv"
brew "tmux"
brew "ctags"
brew "clang-format"

# misc
brew "lf"
brew "jq"

# useful apps & casks
cask "mactex"
cask "rectangle"
cask "alacritty"
cask "karabiner-elements"
cask "font-iosevka"
